Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--geomajas_overview.tmx
Source language: en
Languages: ja

source: Browser GIS Client
ja: ブラウザGISクライアント

source: The Client enables developers to create powerful web GIS applications including interactive maps, extensible widgets and custom use cases. It allows access to a wide range of data sources and functionality through a web browser.
ja: このクライアントを使用すると、開発者はインタラクティブなマップ、拡張可能なウィジェット、カスタムユースケースを含む強力なWeb GISアプリケーションを作成できます。Webブラウザを使用して、幅広いデータソースと機能にアクセスできます。

source: Core Features
ja: 主要機能

source: Programmable using pure Java through GWT
ja: GWT経由でPure Javaを使用してプログラム可能

source: Supports many layer types (incl. WMS, WFS, WMTS, TMS, OSM, Google Maps, Shape, PostGIS, Oracle, JDBC, …)
ja: 多くのレイヤタイプをサポートしています(WMS, WFS, WMTS, TMS, OSM, Google Maps, Shape, PostGIS, Oracle, JDBC, …を含む)

source: Handy collection of built-in widgets (incl. Editing and redlining, Print, Geocoding, Layer tree, ...)
ja: 組み込みウィジェットの便利なコレクション(編集とレッドライン,印刷,ジオコーディング,レイヤ,...を含む)

source: Build your own use cases and create new widgets
ja: 独自のユースケースを構築し、新しいウィジェットを作成する

source: Easy skinnable through custom CSS
ja: カスタムCSSを使用して簡単にスキン可能

source: No need for browser plug-ins
ja: ブラウザにプラグインが不要

source: Runs on a wide range of internet devices using HTML5
ja: HTML5を使用してさまざまなインターネットデバイスで動作します

source: Not a GWT enthusiast? Access core features through the Javascript API
ja: GWTのファンではありませんか?Javascript APIを使用した主な機能へのアクセス

source: Enterprise Server features
ja: エンタープライズサーバーの機能

source: Advanced security on different levels (layer, feature, attribute, functionality, …)
ja: 異なるレベルでの高度なセキュリティ(レイヤ、地物、属性、機能など)

source: Seamless integration with your own Domain Model – persistence via Hibernate, web services, Java RMI, ...
ja: 独自のドメインモデルとのシームレスな統合-Hibernate、Webサービス、Java RMIなどを介した永続性

source: Enterprise integration with other business applications such as JBPM, Activiti, JasperReports, CMS, Alfresco through industry standards (SOAP, REST, ESB, JNDI, …)
ja: 業界標準(SOAP, REST, ESB, JNDI, …)を利用した、JBPM、Activiti、JasperReports、CMS、Alfrescoなどの他のビジネスアプリケーションとのエンタープライズ統合

source: Easy extensible through the Spring framework
ja: Springフレームワークを使用して簡単に拡張可能

source: Details
ja: 詳細

source: **Website:** http://www.geomajas.org
ja: **Webサイト:** http://www.geomajas.org

source: **Licence:** AGPL
ja: **ライセンス:** AGPL

source: **Software Version:** |version-geomajas|
ja: **ソフトウェアバージョン:** |version-geomajas|

source: **Supported Platforms:** Windows, Linux, Mac
ja: **対応プラットフォーム:** Windows, Linux, Mac

source: **API Interfaces:** Java and Javascript
ja: **API インターフェイス:** Java and Javascript

source: **Support:** https://www.osgeo.org/service-providers
ja: **サポート:** https://www.osgeo.org/service-providers

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/geomajas_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/geomajas_quickstart>`
